app/Http/Controllers/QuestionController.php

select * from `questions` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `questions`
---
    public function index()
    {
        $questions = Question::latest()->paginate(5);

        return view('questions.index')->with('questions',$questions);

update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-01-11 14:29:55' where `id` = 1
---
    public function show(Question $question)
    {
        $question->increment('views');

update `questions` set `title` = 'Hello', `slug` = 'hello', `body` = 'Est illum iure rerum deleniti. Temporibus vero aperiam nisi officiis. Amet unde nam fugit rerum architecto. Minus qui sunt commodi aliquam iure.\r\n\r\nEt expedita dolores qui sint distinctio sunt eligendi quisquam. Sed accusamus cupiditate nobis illo quasi. Non quas sed ea molestiae debitis enim. Dolorem eos voluptas non id voluptatem. Qui qui voluptates aut beatae.\r\n\r\nConsequuntur non est sed ipsam iure dolor vel. Assumenda minus et nihil optio labore totam. Laudantium esse consequatur natus voluptatem et veniam.\r\n\r\nCupiditate id qui ut repudiandae et voluptatem harum illo. Ut accusamus natus voluptas voluptatibus doloribus molestiae harum architecto. Expedita voluptates aut enim explicabo laudantium rerum.\r\n\r\nCum nostrum voluptatem voluptatem accusamus laudantium accusantium suscipit quia. Sapiente rerum ducimus necessitatibus molestiae praesentium. Labore porro laboriosam facilis ipsum voluptates.\r\n\r\nQuis vel voluptatem consequatur ipsam quae tempore officiis est. Rerum nam animi sit sint sit temporibus. Laborum blanditiis ut impedit necessitatibus earum. Assumenda earum modi quia provident molestiae fuga voluptatem.\r\n\r\nMagni sed est consequatur ut nihil iusto veritatis. Excepturi rerum possimus tempore et at esse.', `questions`.`updated_at` = '2020-01-11 07:29:46' where `id` = 1
---
    public function update(AskRequestQuestion $request,Question $question)
    {
        if(\Gate::denies('update-question',$question)){
            abort(403,'403');
        }
        $question->update($request->only(['title','body']));

delete from `questions` where `id` = 12
---
    public function destroy(Question $question)
    {
        if(\Gate::denies('delete-question',$question)){
            abort(403,'403');
        }
        $question->delete();