app/Providers/RouteServiceProvider.php

    public function boot()
    {
        Route::bind('slug',function($slug){
            $question = Question::with('answers.user')->where('slug',$slug)->first();
---
select * from `answers` where `answers`.`question_id` in (1)
select * from `questions` where `slug` = 'ipsam-iste-dolores-error-temporibus-modi-aut-sed' limit 1
select * from `users` where `users`.`id` in (1)